УТ_для_edt.РасширениеСмарт/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КомментарийРаспределения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыГрузов/СтатусыГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыГрузов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ПриобретениеУслугПрочихАктивов/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками


// Фролов+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Элементы.Груз.Доступность=РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов");
	ДоступностьЭлементаГруз();
	//++ смарт:rnp 221 19.07.2021
	ДобавитьЭлементыПрограммно();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.смартЗапчастиГарантийные = Истина; //чтобы документ без флажка не улетел в Бух; убрать после доработки синхронизации гарантийных запчастей
	КонецЕсли;
	//-- смарт:rnp 19.07.2021

КонецПроцедуры

#КонецОбласти


#Область ДоработкиСмарт

// Фролов+
&НаСервере
Процедура ДоступностьЭлементаГруз()
	Элементы.ДекорацияГруз.Заголовок=Объект.Груз.СтатусГруза;
	Если Объект.Груз.СтатусГруза=ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Принят") Тогда 
		Элементы.Груз.ТолькоПросмотр=Не РольДоступна("ПолныеПрава");
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.Зеленый;
	Иначе
		Элементы.Груз.ТолькоПросмотр=Не (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов"));
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.ТемноОранжевый;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ГрузНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	смартКешируемоеЗначениеГруза=Объект.Груз;
КонецПроцедуры

&НаКлиенте
Процедура смарт_ГрузПриИзменении(Элемент)
	Если Не Объект.Груз=смартКешируемоеЗначениеГруза Тогда 
		ТекстВопроса="При изменении 'Груза'
					|будет очищена табличная часть
					|'Расходы и прочие активы'.
					|Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСменеГруза",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСменеГруза(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда
		Объект.Расходы.Очистить();
		ДоступностьЭлементаГруз();
	Иначе
		Объект.Груз=смартКешируемоеЗначениеГруза;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьПоГрузу(Команда)
	Если ЗначениеЗаполнено(Объект.Груз) Тогда 
		ОписаниеОповещения=Новый ОписаниеОповещения("ПослеВыбораПараметровЗагрузкиПоГрузу",ЭтаФорма);
		ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.Форма.смарт_ФормаЗаполненияПоГрузу",,ЭтаФорма,,,,ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Груз' не заполнено",,"Объект.Груз");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметровЗагрузкиПоГрузу(Результат,ДопПараметры)Экспорт 
	Если Не Результат=Неопределено Тогда 
		ЗаполнитьРасходыПоГрузуСервер(Результат,КэшированныеЗначения);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРасходыПоГрузуСервер(Данные,КэшированныеЗначения)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	                    |ГДЕ
	                    |	ПриобретениеТоваровУслуг.Груз = &Груз");
	Запрос.УстановитьПараметр("Груз",Объект.Груз);
	
	Объект.Расходы.Очистить();
	
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Стр=Объект.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Данные);
		Стр.АналитикаРасходов=Рез.Ссылка;
		Стр.Количество=1;
		
		Элементы.Расходы.ТекущаяСтрока=Стр.ПолучитьИдентификатор();
		РасходыСтатьяРасходовПриИзмененииСервер(КэшированныеЗначения);
	КонецЦикла;	
КонецПроцедуры	

Процедура ДобавитьЭлементыПрограммно()
	
	//++ смарт:rnp 221 19.07.2021
	смартЗапчастиГарантийные = Элементы.Вставить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	смартЗапчастиГарантийные.Вид = ВидПоляФормы.ПолеФлажка;
	смартЗапчастиГарантийные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	смартЗапчастиГарантийные.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
	смартЗапчастиГарантийные.Заголовок = "Запчасти гарантийные (смарт)";
	//-- смарт:rnp 19.07.2021

КонецПроцедуры 

#КонецОбласти
